# InsulationTypes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingType..::..InsulationTypes Property
TemperatureRatingType Class See Also
---
Get all insulation types defined in this temperature rating type and its corresponding material type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public InsulationTypeSet InsulationTypes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property InsulationTypes As InsulationTypeSet
	Get
```

Visual C++
---
```text
public:
property InsulationTypeSet^ InsulationTypes {
	InsulationTypeSet^ get ();
}
```

# See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace